## Terraform Plan Results

```hcl
Acquiring state lock. This may take a few moments...
data.aws_iam_role.cp_role: Reading...
data.aws_iam_role.existing_ssm_role: Reading...
data.aws_ami.ubuntu: Reading...
data.aws_iam_role.cp_role: Read complete after 1s [id=homelab-cp-role]
data.aws_iam_role.existing_ssm_role: Read complete after 1s [id=ec2-role-for-ssm]
data.aws_ami.ubuntu: Read complete after 1s [id=ami-0607797cadde98e9b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_instance_profile.ec2_ssm_profile will be created
  + resource "aws_iam_instance_profile" "ec2_ssm_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ducksnest-ec2-ssm-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "ec2-role-for-ssm"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_instance_profile.k8s_cp_profile will be created
  + resource "aws_iam_instance_profile" "k8s_cp_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ducksnest-k8s-cp-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "homelab-cp-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_instance.k8s_control_plane will be created
  + resource "aws_instance" "k8s_control_plane" {
      + ami                                  = "ami-0607797cadde98e9b"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + force_destroy                        = false
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "ducksnest-k8s-cp-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t4g.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "ec2-nixos"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_group_id                   = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "ap-northeast-2"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Ansible_Group" = "k8s_control_plane"
          + "Environment"   = "homelab"
          + "Name"          = "ducksnest-k8s-control-plane"
          + "Role"          = "k8s-control-plane"
        }
      + tags_all                             = {
          + "Ansible_Group" = "k8s_control_plane"
          + "Environment"   = "homelab"
          + "Name"          = "ducksnest-k8s-control-plane"
          + "Role"          = "k8s-control-plane"
        }
      + tenancy                              = (known after apply)
      + user_data                            = <<-EOT
            #!/bin/bash
            set -euo pipefail
            
            # Kubernetes Control Plane EC2 with Tailscale
            
            # vars
            HOSTNAME="ducksnest-cp"
            AWS_REGION="ap-northeast-2"
            KUBERNETES_VERSION=v1.33
            CRIO_VERSION=v1.33
            OS_CODENAME="xUbuntu_24.04"
            
            # system update
            apt-get update
            apt-get upgrade -y
            
            # basic packages
            apt-get install -y \
                curl \
                wget \
                git \
                unzip \
                software-properties-common \
                apt-transport-https \
                ca-certificates \
                gnupg \
                lsb-release \
                htop \
                tree \
                jq \
                vim \
                ufw
            
            # Set hostname
            hostnamectl set-hostname "$HOSTNAME"
            if ! grep -q "$HOSTNAME" /etc/hosts; then
              echo "127.0.1.1 $HOSTNAME" >> /etc/hosts
            fi
            
            # Install AWS CLI v2
            echo "Installing AWS CLI v2..."
            ARCH=$(uname -m)
            if [ "$ARCH" = "x86_64" ]; then
                AWS_CLI_ARCH="x86_64"
            elif [ "$ARCH" = "aarch64" ]; then
                AWS_CLI_ARCH="aarch64"
            else
                echo "Unsupported architecture: $ARCH"
                exit 1
            fi
            
            curl "https://awscli.amazonaws.com/awscli-exe-linux-$AWS_CLI_ARCH.zip" -o "awscliv2.zip"
            unzip awscliv2.zip
            ./aws/install
            rm -rf aws awscliv2.zip
            
            # Configure AWS CLI region
            aws configure set region "$AWS_REGION"
            
            # Install Tailscale
            echo "Installing Tailscale..."
            curl -fsSL https://tailscale.com/install.sh | sh
            
            # Get Tailscale auth key from AWS Secrets Manager and connect
            echo "Retrieving Tailscale auth key from Secrets Manager..."
            AUTH_KEY=$(aws secretsmanager get-secret-value \
                --secret-id "tailscale-cp-secret" \
                --query 'SecretString' \
                --output text | jq -r '.["tailscale-cp-key"]')
            
            if [ -z "$AUTH_KEY" ] || [ "$AUTH_KEY" = "null" ]; then
                echo "ERROR: Failed to retrieve Tailscale auth key"
                exit 1
            fi
            
            # Connect to Tailscale
            tailscale up \
                --authkey="$AUTH_KEY" \
                --hostname="$HOSTNAME" \
                --accept-routes \
                --accept-dns
            
            # Wait for connection and get IP
            sleep 10
            TAILSCALE_IP=$(tailscale ip -4)
            echo "Tailscale connected with IP: $TAILSCALE_IP"
            
            # Disable swap
            swapoff -a
            sed -i '/ swap / s/^\(.*\)$/#\1/g' /etc/fstab
            
            
            # Load kernel modules
            cat > /etc/modules-load.d/k8s.conf << EOF
            overlay
            br_netfilter
            EOF
            
            modprobe overlay
            modprobe br_netfilter
            
            # sysctl Variable setting
            cat > /etc/sysctl.d/k8s.conf << EOF
            net.bridge.bridge-nf-call-iptables  = 1
            net.bridge.bridge-nf-call-ip6tables = 1
            net.ipv4.ip_forward                 = 1
            EOF
            
            sysctl --system
            
            # Install the dependencies for adding repositories
            apt-get update
            apt-get install -y software-properties-common curl
            
            # add K8s repository
            sudo apt-get install -y apt-transport-https ca-certificates curl gpg
            curl -fsSL https://pkgs.k8s.io/core:/stable:/$KUBERNETES_VERSION/deb/Release.key | sudo gpg --dearmor -o /etc/apt/keyrings/kubernetes-apt-keyring.gpg
            echo "deb [signed-by=/etc/apt/keyrings/kubernetes-apt-keyring.gpg] https://pkgs.k8s.io/core:/stable:/$KUBERNETES_VERSION/deb/ /" | sudo tee /etc/apt/sources.list.d/kubernetes.list
            
            # Add CRI-O repository
            curl -fsSL https://download.opensuse.org/repositories/isv:/cri-o:/stable:/$CRIO_VERSION/deb/Release.key |
                gpg --dearmor -o /etc/apt/keyrings/cri-o-apt-keyring.gpg
            
            echo "deb [signed-by=/etc/apt/keyrings/cri-o-apt-keyring.gpg] https://download.opensuse.org/repositories/isv:/cri-o:/stable:/$CRIO_VERSION/deb/ /" |
                tee /etc/apt/sources.list.d/cri-o.list
            
            # Install Kubernetes packages
            sudo apt-get update
            sudo apt-get install -y cri-o kubelet kubeadm kubectl
            sudo apt-mark hold kubelet kubeadm kubectl
            
            sudo systemctl start crio.service
            sudo systemctl enable crio.service
            sudo systemctl enable --now kubelet
            
            # System optimization
            echo 'vm.max_map_count=262144' >> /etc/sysctl.conf
            echo 'fs.file-max=65536' >> /etc/sysctl.conf
            sysctl -p
            
            
            # Create status file
            cat > /tmp/tailscale-cp-info.json << EOF
            {
              "hostname": "$HOSTNAME",
              "tailscale_ip": "$TAILSCALE_IP",
              "kubernetes_version": "$KUBERNETES_VERSION",
              "setup_completed": "$(date -Iseconds)"
            }
            EOF
            
            # Completion marker
            touch /var/lib/cloud/instance/boot-finished
            echo "Kubernetes Control Plane with Tailscale initialization completed at $(date)" > /var/log/init-complete.log
            echo "Control Plane Tailscale IP: $TAILSCALE_IP"
        EOT
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + primary_network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 20
          + volume_type           = "gp3"
        }
    }

  # aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "ap-northeast-2"
      + tags     = {
          + "Environment" = "homelab"
          + "Name"        = "ducksnest-igw"
        }
      + tags_all = {
          + "Environment" = "homelab"
          + "Name"        = "ducksnest-igw"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "ap-northeast-2"
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "homelab"
          + "Name"        = "ducksnest-public-rt"
        }
      + tags_all         = {
          + "Environment" = "homelab"
          + "Name"        = "ducksnest-public-rt"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.a will be created
  + resource "aws_route_table_association" "a" {
      + id             = (known after apply)
      + region         = "ap-northeast-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.c will be created
  + resource "aws_route_table_association" "c" {
      + id             = (known after apply)
      + region         = "ap-northeast-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.strict_egress will be created
  + resource "aws_security_group" "strict_egress" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "strict-egress"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "ap-northeast-2"
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.public_a will be created
  + resource "aws_subnet" "public_a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.20.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-2"
      + tags                                           = {
          + "Environment" = "homelab"
          + "Name"        = "ducksnest-public-subnet"
        }
      + tags_all                                       = {
          + "Environment" = "homelab"
          + "Name"        = "ducksnest-public-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public_c will be created
  + resource "aws_subnet" "public_c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.20.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-2"
      + tags                                           = {
          + "Environment" = "homelab"
          + "Name"        = "ducksnest-public-subnet"
        }
      + tags_all                                       = {
          + "Environment" = "homelab"
          + "Name"        = "ducksnest-public-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.20.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "ap-northeast-2"
      + tags                                 = {
          + "Environment" = "homelab"
          + "Name"        = "ducksnest-vpc"
        }
      + tags_all                             = {
          + "Environment" = "homelab"
          + "Name"        = "ducksnest-vpc"
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + k8s_control_plane_private_ip = (known after apply)
  + k8s_control_plane_public_ip  = (known after apply)
  + subnet_a_id                  = (known after apply)
  + subnet_c_id                  = (known after apply)
  + vpc_id                       = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

**Plan Status:** Success
**Commit:** 52d65693c7ec57eac3b9bdf4ef7f81d006c0e103
**Workflow:** [5](https://github.com/DuckOriDuck/ducksnest-homelab/actions/runs/17485747196)